[
    "Fashion company Shein has confidentially filed to go public in the United States, two sources familiar with the matter said on Monday, in what is likely to be one of the most valuable China-founded companies to go public in the U.S.",
    "Police responded to a disturbance on plane in New Orleans when a man climbed on to a planes wing while it was still on a skyway at New Orleans Louis Armstrong International Airport",
    "Cyber Monday discounts : From gaming to holiday decor",
    "Missed Black Friday? Don't fret: The Lululemon Cyber Monday sale is here, with  deals of up to 63% off. Save on popular leggings, workout gear and more.",
    "These products are beloved by many, so you might as well hop on that bandwagon while these babies are on sale.",
    "The major averages are still on track for notable gains in 2023's penultimate month.",
    "Bank of America and Deutsch Bank both released outlooks predicting the Federal Reserve will cut interest rates next year. The latter says the U.S. will enter a \"mild recession.\"",
    "Major benchmarks on track to record strong monthly gains",
    "Keri Witman told 'Good Morning America' she had already paid $32,000 for her trip with Life at Sea Cruises, which was originally planned to depart from Istanbul on Nov. 1.",
    "This article delves into the technical outlook for gold (XAU/USD) and AUD/USD, concentrating on market sentiment, price action dynamics and critical levels at play for the upcoming trading sessions.",
    "On Cyber Monday, consumers are expected to spend as much as $12.4B, which marks an all-time high. However, they are even more focused on spreading out their bills.",
    "The FDA approved Ogsiveo tablets for adult patients with progressing desmoid tumors who require systemic treatment.",
    "Zscaler earnings for fiscal Q1 topped estimates. The cybersecurity firm's guidance for ZS stock edged by views.",
    "Mark Zuckerberg might have enjoyed a \"Hot Zuck Summer,\" but the latest disturbing crisis at Meta means we're now in \"Instagram Nightmare Fall.\"",
    "Sticker shock, a feeling as old as commerce itself, is no longer just an irksome, unexpectedly high bill. In the era of social media, overpaying for dinner is an invitation for anyone and everyone to publicly shake their fist over the health of the global eco…",
    "Amazon shares rose after announcing an expanded partnership with Salesforce and a report Amazon surpassed FedEx and UPS to become the biggest U.S. package delivery firm.",
    "Volkswagen’s original brand is “no longer competitive,” the company’s brand chief warned Monday, owing to high costs and low productivity."
]